// Tọa độ các trạm MQTT
const MQTT_STATION_COORDINATES = {
    'QT1_NM2': { lat: 9.205658, lng: 105.12963 },
    'QT2_NM2': { lat: 9.203337, lng: 105.129712 },
    'QT2M': { lat: 9.179219, lng: 105.139376 },
    'QT4': { lat: 9.178851, lng: 105.162845 },
    'QT5': { lat: 9.178642307966712, lng: 105.1542747288355 },
    'GS1_NM2': { lat: 9.205104, lng: 105.131994 },
    'GS2_NM1': { lat: 9.173416, lng: 105.209793 },
    'G15': { lat: 9.1835, lng: 105.152611 },
    'G18': { lat: 9.175669, lng: 105.170509 },
    'G31B': { lat: 9.206425975447889, lng: 105.16646383795273 },
    'GTACVAN': { lat: 9.163367389961877, lng: 105.25151245767171 },
    'G29A': { lat: 9.14649, lng: 105.139282 },
    'G30A': { lat: 9.165363, lng: 105.157047 }
};

module.exports = { MQTT_STATION_COORDINATES };
